{
  "class_name": "Model",
  "config": {
    "name": "model",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 64, 1],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3],
          "strides": [1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1d",
        "inbound_nodes": [[["input_1", 0, 0, {}]]]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation",
        "inbound_nodes": [[["conv1d", 0, 0, {}]]]
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3],
          "strides": [1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1d_1",
        "inbound_nodes": [[["activation", 0, 0, {}]]]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_1",
        "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_2",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3],
          "strides": [1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1d_2",
        "inbound_nodes": [[["activation_1", 0, 0, {}]]]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_2",
        "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_3",
          "trainable": true,
          "dtype": "float32",
          "filters": 512,
          "kernel_size": [3],
          "strides": [1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1d_3",
        "inbound_nodes": [[["activation_2", 0, 0, {}]]]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_3",
        "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "name": "flatten",
        "inbound_nodes": [[["activation_3", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 1024,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense",
        "inbound_nodes": [[["flatten", 0, 0, {}]]]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_4",
        "inbound_nodes": [[["dense", 0, 0, {}]]]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout",
        "inbound_nodes": [[["activation_4", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 512,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [[["dropout", 0, 0, {}]]]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_5",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_5",
        "inbound_nodes": [[["dense_1", 0, 0, {}]]]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "noise_shape": null,
          "seed": null
        },
        "name": "dropout_1",
        "inbound_nodes": [[["activation_5", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "pi",
          "trainable": true,
          "dtype": "float32",
          "units": 60,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "pi",
        "inbound_nodes": [[["dropout_1", 0, 0, {}]]]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "v",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "v",
        "inbound_nodes": [[["dropout_1", 0, 0, {}]]]
      }
    ],
    "input_layers": [["input_1", 0, 0]],
    "output_layers": [
      ["pi", 0, 0],
      ["v", 0, 0]
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}
